IDEA Open Model
ResultType Enumeration
Compatible with IDEA StatiCa 20.1
 Type of results
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum ResultType
Public Enumeration ResultType
Members
Member name | Value | Description
InternalForces | 0 |  Internal forces
Deformation | 1 |  Deformation
CrossSectionNLA | 2 |  NLA on cross-section
CrossSectionTA | 3 |  TA on cross-section
InteractionDiagram | 4 |  Interaction digaram on section
CrossSectionMesh | 5 |  Mesh on cross-section
See Also
Reference
IdeaRS.OpenModel.Result Namespace